---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainPrepdepth
source: html/d5ec8f89-85a8-5ad1-43ed-b884993fab96.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainPrepdepth Property

"Main Preparation Depth"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeldMainPrepdepth { get; }
```